---
kind: property
id: P:Autodesk.Revit.DB.ProjectPosition.EastWest
source: html/2b1ce41d-e6db-6b51-fa6c-7119692b6e05.htm
---
# Autodesk.Revit.DB.ProjectPosition.EastWest Property

East/West offset.

## Syntax (C#)
```csharp
public double EastWest { get; set; }
```

## Remarks
The offset of the project location from the site location in
 the east/west direction. Measured in decimal feet.